atmosphere/tutorials/02-EFR_test_case/TB_Test/TB_62.5_DB/0.orig/aU
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      aU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    top
    {
        
        type            calculated;
	value $internalField; 
    }

    bottom
    {
 
        type            calculated;
	value 		$internalField; 
    }

    right
    {
     
        type           calculated;
	value		$internalField;
    }

    left
    {
        type          calculated;
	value 		$internalField;
    }
    frontandback
   {
	type empty;
   }
}

// ************************************************************************* //
