atmosphere/tutorials/02-EFR_test_case/TB_Test/TB_62.5_DB/0.orig/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
4096
(
-7256.61
-7258.33
-7261.74
-7266.74
-7273.23
-7281.06
-7290.05
-7300.02
...
)
;

boundaryField
{
    top
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
128
(
-5.4146
-5.41475
-5.41504
-5.41547
-5.41603
-5.41671
-5.41749
-5.41836
...
)
;
        value           nonuniform List<scalar> 
128
(
-22023
-22020.9
-22016.7
-22010.5
-22002.4
-21992.7
-21981.4
-21968.9
...
)
;
    }
    bottom
    {
        type            fixedFluxPressure;
        gradient        uniform -0;
        value           nonuniform List<scalar> 
128
(
-7256.61
-7258.33
-7261.74
-7266.74
-7273.23
-7281.06
-7290.05
-7300.02
...
)
;
    }
    left
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
32
(
-7256.61
-7288.67
-7352.01
-7445.83
-7569.27
-7718.35
-7869.92
-8015.04
...
)
;
    }
    right
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
32
(
-7520.3
-7554.01
-7620.79
-7719.97
-7850.92
-8012.98
-8205.52
-8427.89
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
